/*
例题一、01背包问题
假设山洞里共有a,b,c,d ,e这5件宝物（不是5种宝物），它们的重量分别是2,2,6,5,4，
它们的价值分别是6,3,5,4,6，现在给你个承重为10的背包, 怎么装背包，可以才能带走最多的财富。

i  name weight value | j: 1   2   3   4   5   6   7   8   9   10
1   a     4     6    |    0   0   0   6   6   6   6   6   6   6
2   b     5     4    |    0   0   0   0   6   6   6   6   10  10
3   c     6     5    |    0   0   0   6   6   6   6   6   10  11
4   d     2     3    |    0   3 	3   6 	6   9 	9  	9 	10 	11
5   e     2     6    |    0   6 	6   9 	9   12  12 	15 	15 	15

// 二维动态规划, f[i, j]表示到第i个宝物为止, 使用j大小的背包所获得的财富
for i in [1, 5]:
  for j in [W_i, 10]:
    // j in [1, 10] and j-W_i >= 0
    f[i, j] = max(f[i-1, j], f[i-1, j-W_i]+V_i)

f[1, 4]  = max(f[0, 4], f[0, 0]+W_1)
f[1, 5]  = max(f[0, 4], f[0, 1]+W_1)
f[1, 6]  = max(f[0, 4], f[0, 2]+W_1)
...
f[1, 9]  = max(f[0, 4], f[0, 5]+W_1)
f[1, 10] = max(f[0, 4], f[0, 6]+W_1)


*/
